Процедура УстановитьПараметры(Схема,Настройки)
	
	
	Эл = Настройки.ПараметрыДанных.Элементы.Найти("Дт");
	Эл.Использование = Истина;
	Эл.Значение = НачалоДня(Дт);
	//
	//
	//Эл = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	//Эл.Использование = Истина;
	//Эл.Значение = НачалоДня(Дт);
	//                                                                                     
	//Эл = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	//Эл.Использование = Истина;
	//Эл.Значение = КонецДня(Дт1);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруГруппировок(ТекСпкГрупп,ТекГрп,ЭтоТаблицаСкд)
	
	Для каждого Эл из ТекСпкГрупп Цикл
		Если Эл.Пометка = Ложь Тогда Продолжить; КонецЕсли;
		
		Если ТипЗнч(ЭтоТаблицаСкд) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") ТОгда //для колонок, чтобы каждая колонка была в отдельной группе
			ТекГрп = ЭтоТаблицаСкд.Добавить();
		ИначеЕсли ТипЗнч(ТекГрп) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") ТОгда
			ТекГрп = ТекГрп.Добавить();
		ИначеЕсли ЭтоТаблицаСкд ТОгда
			ТекГрп = ТекГрп.Структура.Добавить();
		ИНаче
			ТекГрп = ТекГрп.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		КонецЕСЛИ;
		СкопироватьГруппировку(ТекГрп,эл.значение);
		ТекГрп.Использование = Истина; 
		
		Если ТипЗнч(ЭтоТаблицаСкд) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") ТОгда //для колонок
			УстановитьПараметрКомпоновкиДанных(ТекГрп);  
		КонецесЛИ;
		
	КонецЦикла;    
	
	Если ТипЗнч(ЭтоТаблицаСкд) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") ТОгда //для колонок добавим общий итог
		ТекГрп = ЭтоТаблицаСкд.Добавить();  
		СкопироватьГруппировку(ТекГрп,ТекСпкГрупп[0].значение); 
		ТекГрп.ПоляГруппировки.Элементы[0].Поле = Новый ПолеКомпоновкиДанных("ИтогоСлужебный");
		ТекГрп.Использование = Истина; 
		УстановитьПараметрКомпоновкиДанных(ТекГрп);  
	КонецесЛИ;  
		
КонецПроцедуры

Функция Данные(АдресРасшифровкиДанных,АдресСКД,идФормы) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.Настройки;
	
	УстановитьПараметры(Схема,Настройки);
	
	//Порядок Группировок
	ЭтоТаблицаСкд = ложь;
	ТекГрп = Настройки;
	текГрпКол = Неопределено;
	Если ТипЗнч(ТекГрп.Структура[0]) = ТИп("ТаблицаКомпоновкиДанных") ТОгда 
		ТекГрп = ТекГрп.Структура[0].Строки;
		текГрпКол = Настройки.Структура[0].Колонки;
		ЭтоТаблицаСКД = Истина;
		
		ТекГрп.Очистить();
		текГрпКол.Очистить();
	ИНаче
		ТекГрп.Структура.Очистить();
	КонецЕСЛИ;	
	ЗаполнитьСтруктуруГруппировок(СпкГрупп,  ТекГрп,   ЭтоТаблицаСкд);
	ЗаполнитьСтруктуруГруппировок(СпкКолонки,Неопределено,текГрпКол);
	
		
	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема,Настройки,ДанныеРасшифровки,ПолучитьМакет("МакетОформления"),,Ложь);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,ДанныеРасшифровки,истина,Ложь);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	Таб = Новый ТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(Таб);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	АдресРасшифровкиДанных = ПоместитьВоВременноеХранилище(ДанныеРасшифровки,идФормы);
	АдресСКД = ПоместитьВоВременноеХранилище(Схема,идФормы);
	
	Возврат Таб;
	
КонецФункции

Процедура УстановитьПараметрКомпоновкиДанных(Грп)
	
	Пар = Новый ПараметрКомпоновкиДанных("РасположениеОбщихИтогов");
	Эл = Грп.ПараметрыВывода.Элементы.Найти(Пар);
	Если Эл = Неопределено ТОгда
		ВозвраТ;
	КонецесЛИ;   
	Эл.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	Эл.Использование = Истина;
	
Конецпроцедуры

Процедура СкопироватьГруппировку(НовГрп,Грп) Экспорт
	
	ЗаполнитьЗначенияСвойств(НовГрп,Грп);
	
	ДЛя каждого эл из Грп.Выбор.Элементы Цикл
		НовЭл = НовГрп.Выбор.Элементы.Добавить(ТипЗнч(Эл));
		ЗаполнитьЗначенияСвойств(НовЭл,Эл);
	КонецЦикла;
	
	Для каждого эл из Грп.ПараметрыВывода.Элементы Цикл
		НовЭл = НовГрп.ПараметрыВывода.Элементы.Найти(СокрЛП(Эл.Параметр));
		Если новЭл<>Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НовЭл,Эл);
		КонецеСлИ;
	Конеццикла;
	
	ДЛя каждого эл из Грп.Порядок.Элементы Цикл
		НовЭл = НовГрп.Порядок.Элементы.Добавить(ТипЗнч(Эл));
		ЗаполнитьЗначенияСвойств(НовЭл,Эл);
	КонецЦикла;
	
	ДЛя каждого эл из Грп.ПоляГруппировки.Элементы Цикл
		НовЭл = НовГрп.ПоляГруппировки.Элементы.Добавить(ТипЗнч(Эл));
		ЗаполнитьЗначенияСвойств(НовЭл,Эл);
	КонецЦикла;
	
	ДЛя каждого эл из Грп.Отбор.Элементы Цикл
		НовЭл = НовГрп.Отбор.Элементы.Добавить(ТипЗнч(Эл));
		ЗаполнитьЗначенияСвойств(НовЭл,Эл);
	КонецЦикла;
	
КонецПроцедуры

